src/Конфигурация/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Конфигурация/Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если СтарыйПользователь <> Объект.Пользователь Тогда
		Если ЗначениеЗаполнено(СтарыйПользователь)  Тогда
			ОбъектПользователь = СтарыйПользователь.ПолучитьОбъект();
			ОбъектПользователь.ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
			ОбъектПользователь.Подразделение = Справочники.Подразделения.ПустаяСсылка();
			ОбъектПользователь.Записать();
		КонецЕсли; 
		Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
			ОбъектПользователь = Объект.Пользователь.ПолучитьОбъект();
			ОбъектПользователь.ФизическоеЛицо = Объект.Ссылка;
			ОбъектПользователь.Подразделение = Объект.Должность.Владелец;
			ОбъектПользователь.Записать();
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтарыйПользователь = Объект.Пользователь;
КонецПроцедуры
